[
    {
        "id": "01",
        "name": "Web development",
        "author_name": "Michele Hints",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "img": "https://tse3.mm.bing.net/th?id=OIP.8R2Szu6wOEOXkz_RFq6KbgHaEK&pid=Api&P=0",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "Learn front-end and hybrid mobile development, with server-side support, for implementing a multi-platform solution.The first two courses in this Specialization cover front-end frameworks: Bootstrap 4 and React. On the server side, you’ll learn to implement NoSQL databases using MongoDB, work within a Node.js environment and Express framework, and communicate to the client side through a RESTful API. Learners enrolling in this Specialization are expected to have prior working knowledge of HTML, CSS and JavaScript.Ideally learners should complete the courses in the specified sequence. Learners will work on hands-on exercises, culminating in development of a full-fledged application at the end of each course. Each course also includes a mini-Capstone Project as part of the Honors Track where you’ll apply your skills to build a fully functional project.",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "02",
        "name": "App development",
        "img": "https://tse3.mm.bing.net/th?id=OIP.8bH8gCSNvHdHelHgEsnEFgHaDt&pid=Api&P=0",
        "author_name": "Charles Baj",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "This Specialization enables learners to successfully apply core Java programming languages features & software patterns needed to develop maintainable mobile apps comprised of core Android components, as well as fundamental Java I/O & persistence mechanisms. The Capstone project will integrate the material from throughout the Specialization to exercise and assess the ability of learners to create an interesting Android app by applying knowledge and skills learned in previous MOOCs, including Java programming features, Android Studio tools, Android Activity components, Material Design, file I/O and data persistence, unit testing, and software patterns. The project itself will be similar in design goals to previous assignments, however it will provide less of the skeleton code than earlier MOOCs provide to enable more creativity to learners and greater opportunity for learners to customize the app. ",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "03",
        "name": "Digital Marketing",
        "img": "https://business-news.ucdenver.edu/wp-content/uploads/2020/10/Digital-Marketing-2020-2048x1158.jpg",
        "author_name": "Stephen Mars",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "This is the first of seven courses in the Google Digital Marketing & E-commerce Certificate, which will equip you with the skills you need to apply to entry-level roles in these fields. People who work in digital marketing and e-commerce help their organizations attract new customers, engage customers through various digital channels, and drive transactions like purchases and customer loyalty. In this course, you’ll explore entry-level jobs in digital marketing and e-commerce and identify the roles and functions that those jobs play within an organization. You’ll also learn about the marketing funnel and how it shapes the customer journey. Google employees who currently work in the field will guide you, providing hands-on activities and examples that simulate common digital marketing and e-commerce tasks, and helping you build your skills and prepare for the job. Learners who complete the seven courses in this program will be equipped to apply for entry-level jobs in digital marketing and e-commerce. No previous experience is necessary",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "04",
        "name": "Data Science",
        "img": "https://tse3.mm.bing.net/th?id=OIP.B2ZuIXdyodArav27RJL8GwHaEK&pid=Api&P=0",
        "author_name": "Michele Telika",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "Fundamental concepts in probability, statistics and linear models are primary building blocks for data science work.  Learners aspiring to become biostatisticians and data scientists will benefit from the foundational knowledge being offered in this specialization.  It will enable the learner to understand the behind-the-scenes mechanism of key modeling tools in data science, like least squares and linear regression.This specialization starts with Mathematical Statistics bootcamps, specifically concepts and methods used in biostatistics applications.  These range from probability, distribution, and likelihood concepts to hypothesis testing and case-control sampling.This specialization also linear models for data science, starting from understanding least squares from a linear algebraic and mathematical perspective, to statistical linear models, including multivariate regression using the R programming language.  These courses will give learners a firm foundation in the linear algebraic treatment of regression modeling, which will greatly augment applied data scientists' general understanding of regression models. This specialization requires a fair amount of mathematical sophistication. Basic calculus and linear algebra are required to engage in the content. ",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "05",
        "name": "Machine Learning",
        "img": "https://www.nag.com/sites/default/files/styles/banner/public/2020-08/machine-learning.jpeg?itok=4WFu3LAS",
        "author_name": "Charles Mambi",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. This beginner-friendly program will teach you the fundamentals of machine learning and how to use these techniques to build real-world AI applications. This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field. This 3-course Specialization is an updated version of Andrew’s pioneering Machine Learning course, rated 4.9 out of 5 and taken by over 4.8 million learners since it launched in 2012. It provides a broad introduction to modern machine learning, including supervised learning (multiple linear regression, logistic regression, neural networks, and decision trees), unsupervised learning (clustering, dimensionality reduction, recommender systems), and some of the best practices used in Silicon Valley for artificial intelligence and machine learning innovation (evaluating and tuning models, taking a data-centric approach to improving performance, and more.) By the end of this Specialization, you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems. If you’re looking to break into AI or build a career in machine learning, the new Machine Learning Specialization is the best place to start.",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "06",
        "name": "Artificial Intelligence",
        "img": "https://tse4.mm.bing.net/th?id=OIP.JDNAknsJHPuHgQC_ROiBZgHaEJ&pid=Api&P=0",
        "author_name": "Ayshal Giys",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "Artificial intelligence (AI) is revolutionizing entire industries, changing the way companies across sectors leverage data to make decisions. To stay competitive, organizations need qualified AI engineers who use cutting-edge methods like machine learning algorithms and deep learning neural networks to provide data driven actionable intelligence for their businesses. This 6-course Professional Certificate is designed to equip you with the tools you need to succeed in your career as an AI or ML engineer.You’ll master fundamental concepts of machine learning and deep learning, including supervised and unsupervised learning, using programming languages like Python. You’ll apply popular machine learning and deep learning libraries such as SciPy, ScikitLearn, Keras, PyTorch, and Tensorflow to industry problems involving object recognition, computer vision, image and video processing, text analytics, natural language processing (NLP), recommender systems, and other types of classifiers.Through hands-on projects, you’ll gain essential data science skills scaling machine learning algorithms on big data using Apache Spark. You’ll build, train, and deploy different types of deep architectures, including convolutional neural networks, recurrent networks, and autoencoders.In addition to earning a Professional Certificate from Coursera, you will also receive a digital badge from IBM recognizing your proficiency in AI engineering. ",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "07",
        "name": "Big Data",
        "img": "https://tse2.mm.bing.net/th?id=OIP.sjeCYz3Y-40HinzKLM6CEQHaEN&pid=Api&P=0",
        "author_name": "Whistal Maris",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "Bernard Marr defines Big Data as the digital trace that we are generating in this digital era. In this course, you will learn about the characteristics of Big Data and its application in Big Data Analytics. You will gain an understanding about the features, benefits, limitations, and applications of some of the Big Data processing tools. You’ll explore how Hadoop and Hive help leverage the benefits of Big Data while overcoming some of the challenges it poses. Hadoop is an open-source framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. Hive, a data warehouse software, provides an SQL-like interface to efficiently query and manipulate large data sets residing in various databases and file systems that integrate with Hadoop.Apache Spark is an open-source processing engine that provides users new ways to store and make use of big data. It is an open-source processing engine built around speed, ease of use, and analytics. In this course, you will discover how to leverage Spark to deliver reliable insights. The course provides an overview of the platform, going into the different components that make up Apache Spark. In this course, you will also learn about Resilient Distributed Datasets, or RDDs, that enable parallel processing across the nodes of a Spark cluster.",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "08",
        "name": "Neural Network",
        "img": "https://tse3.mm.bing.net/th?id=OIP.9nJUnGMC_HTWiiyq2VEW_wHaEo&pid=Api&P=0",
        "author_name": "Piter Marker",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "In the second course of the Deep Learning Specialization, you will open the deep learning black box to understand the processes that drive performance and generate good results systematically. By the end, you will learn the best practices to train and develop test sets and analyze bias/variance for building deep learning applications; be able to use standard neural network techniques such as initialization, L2 and dropout regularization, hyperparameter tuning, batch normalization, and gradient checking; implement and apply a variety of optimization algorithms, such as mini-batch gradient descent, Momentum, RMSprop and Adam, and check for their convergence; and implement a neural network in TensorFlow.The Deep Learning Specialization is our foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to gain the knowledge and skills to apply machine learning to your work, level up your technical career, and take the definitive step in the world of AI.",
        "Enrolled": 138,
        "rating": 4.5
    },
    {
        "id": "09",
        "name": "Computer Networking",
        "img": "https://tse1.mm.bing.net/th?id=OIP.3c0OzJhFhnoUljDnuYevmQHaDq&pid=Api&P=0",
        "author_name": "Parker Malin",
        "author_img": "https://images.gr-assets.com/authors/1378391446p8/7086591.jpg",
        "Duration": "02 hours 20 minutes",
        "last_update": "2 Aug 2022",
        "Lessons": "10 Lessons",
        "description": "In this course, we trace the evolution of networks and identify the key concepts and functions that form the basis for layered architecture. We introduce examples of protocols and services that are familiar to the students, and we explain how these services are supported by networks. Further, we explain fundamental concepts in digital communication, and focus on error control techniques that include parity check, polynomial code, and Internet checksum. Students will be required to have some previous programming experience in C-programming (C++/Java), some fundamental knowledge of computer organization and IT architecture and a background in computer science is a plus.",
        "Enrolled": 138,
        "rating": 4.5
    }
]